---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangle
source: html/90199da7-1b63-12c1-632f-62907ee8acf8.htm
---
# StructuralSectionConcreteRectangle Members

Creates a new instance of Structural Section Concrete Rectangle shape with the associated set of parameters,
 used to attach to structural element.